---
type: ExternalApplicationArrayIterator
namespace: Autodesk.Revit.UI
version: 2024
members: 4
tags: [revit-api, class]
---

# ExternalApplicationArrayIterator

`Autodesk.Revit.UI.ExternalApplicationArrayIterator` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ExternalApplicationArrayIterator | — | `public ExternalApplicationArrayIterator ()` |
| Method | MoveNext | — | `public virtual bool MoveNext ()` |
| Method | Reset | — | `public virtual void Reset ()` |
| Property | Current | — | `public virtual Object Current { get ; }` |